; === Dragoon abilities ===

[ShadowOps_ShieldProtocol X2AbilityTemplate]
LocFriendlyName="护盾协议"
LocLongDescription="给予一个友方单位能量护盾，可吸收<Ability:Shield/>点伤害。护盾持续到任务结束或直到摧毁，同时赋予毒素免疫。"
LocHelpText="给予一个友方单位能量护盾，可吸收<Ability:Shield/>点伤害。"
LocFlyOverText="护盾协议"
LocPromotionPopupText="<Bullet/>高级的小精灵可以提供更强力的护盾。<br/><Bullet/>护盾吸收的伤害不会造成受伤，所以尽量在你的士兵受伤之前就给他们套上护盾。<br/><Bullet/>要考虑到给身陷险境的单位留一次护盾协议。<br/><Bullet/>护盾一直存在，除非吸收的伤害达到其容量，或者龙骑兵死亡、撤离。<br/><Bullet/>护盾也赋予毒素免疫。<br/><Bullet/>护盾协议每次任务可使用两次。<br/>"

[ShadowOps_AdvancedShieldProtocol X2AbilityTemplate]
LocFriendlyName="高级护盾协议"
LocLongDescription="使用护盾协议不再消耗行动点。"
LocHelpText="给予一个友方单位能量护盾，可吸收<Ability:Shield/>点伤害。此能力不消耗行动点。"
LocFlyOverText="高级护盾协议"
LocPromotionPopupText="<Bullet/>高级的小精灵可以提供更强力的护盾。<br/><Bullet/>护盾吸收的伤害不会造成受伤，所以尽量在你的士兵受伤之前就给他们套上护盾。<br/><Bullet/>要考虑到给身陷险境的单位留一次护盾协议。<br/><Bullet/>护盾一直存在，除非吸收的伤害达到其容量，或者龙骑兵死亡、撤离。<br/><Bullet/>护盾也赋予毒素免疫。<br/><Bullet/>护盾协议每次任务可使用两次。<br/>"

[ShadowOps_HeavyArmor X2AbilityTemplate]
LocFriendlyName="坦克"
LocLongDescription="根据所穿装甲获得额外护甲。"
LocHelpText="根据所穿装甲获得额外护甲。"
LocFlyOverText="坦克"
LocPromotionPopupText="<Bullet/>拥有坦克技能的龙骑士穿上E.X.O.护甲或者W.A.R.护甲后，如果再搭配镀层背心或者加固背心，就可以吸收超大量的伤害。<br/><Bullet/>护盾协议产生的护盾不会直接因为护甲而受益，但是超过其吸收容量的伤害仍然会受到护甲减免。只要哪怕只有一点伤害被护甲吸收， 护甲就可以完全无视小量伤害。<br/><Bullet/>轻型和中型护甲提供额外一点护甲，重型护甲提供额外两点护甲。<br/>"

[ShadowOps_Finesse X2AbilityTemplate]
LocFriendlyName="高明技巧"
LocLongDescription="装备突击步枪时，命中<Ability:+ToHit/>，移动力<Ability:+Mobility/>。"
LocHelpText="装备突击步枪时，命中<Ability:+ToHit/>，移动力<Ability:+Mobility/>。"
LocFlyOverText="高明技巧"
LocPromotionPopupText="<Bullet/>高明技巧赋予的额外移动力可以让你快速暴露敌人侧翼或抵达目标地点，但是要小心别走在小队太前面。<br/><Bullet>如果你装备了加农炮，那么高明技巧的加成就消失了。可以由任何单位装备的武器也视作突击步枪，比如弩枪，也同样获得高明技巧加成。<br/><Bullet/>学会高明技巧后会自动装备上库存中最高级的突击步枪。<br/>"

[ShadowOps_StealthProtocol X2AbilityTemplate]
LocFriendlyName="隐匿协议"
LocLongDescription="让一个友方单位获得隐蔽状态。"
LocHelpText="让一个友方单位获得隐蔽状态。"
LocFlyOverText="隐匿协议"
LocPromotionPopupText="<Bullet/>隐匿协议可以用在任何士兵身上，所以在选择出战士兵时就要考虑把这个技能用在谁身上。<br/><Bullet/>隐匿协议有时候可以用来保护陷入尴尬境地的士兵，但是它无法用于侧翼暴露的士兵。<br/><Bullet/>使用隐匿协议消耗一个行动点。<br/><Bullet/>如果龙骑兵死亡或撤离，效果将消失。<br/><Bullet/>隐匿协议每次任务可用一次。<br/>"

[ShadowOps_BurstFire X2AbilityTemplate]
LocFriendlyName="火力弹幕"
LocLongDescription="攻击一条直线上的所有目标，损坏或摧毁掩体。仅用于加农炮。消耗<Ability:SelfAmmoCost/>发弹药。<Ability:SelfCooldown/>回合冷却。"
LocHelpText="攻击一条直线上的所有目标，损坏或摧毁掩体。"
LocFlyOverText="火力弹幕"
LocPromotionPopupText="<Bullet/>火力弹幕有70%几率伤害目标，100%几率损坏或摧毁掩体。<br/><Bullet/>如果处于合适的位置，火力弹幕可以击中多个敌人。不过用在单个目标上也是可以的。<br/><Bullet/>开火前要注意火力弹幕将会毁坏的东西，包括目标背后的东西。<br/><Bullet/>在全身掩体中发动火力弹幕时务必注意。士兵可能\"踏出一步\"，从而使火力弹幕瞄准一条与你预期不符的直线。<br/><Bullet/>火力弹幕需要<Ability:SelfAmmoCost/>发弹药和<Ability:SelfCooldown/>回合冷却。<br/>"

[ShadowOps_ShieldsUp X2AbilityTemplate]
LocFriendlyName="重装上阵"
LocLongDescription="每个小队成员在任务开始时都获得可吸收<Ability:Shield/>点伤害的护盾。"
LocHelpText="每个小队成员在任务开始时都获得可吸收<Ability:Shield/>点伤害的护盾。"
LocFlyOverText="重装上阵"
LocPromotionPopupText="<Bullet/>高级的小精灵可以提供更强力的护盾。<br/><Bullet/>重装上阵给予的护盾虽小，但可以拯救士兵的性命，或者单纯缩短受伤后的恢复时间。<br/><Bullet/>重装上阵和护盾协议不同，不会赋予毒素免疫。<br/><Bullet/> 如果龙骑兵死亡或撤离，护盾将移除。<br/>"

[ShadowOps_ECM X2AbilityTemplate]
LocFriendlyName="电子反制措施"
LocLongDescription="在隐蔽状态下，敌人对所有小队成员的侦察范围减少20%。"
LocHelpText="在隐蔽状态下，敌人对所有小队成员的侦察范围减少20%。"
LocFlyOverText="电子反制措施"
LocPromotionPopupText="<Bullet/>如果龙骑士死亡或撤离，此效果将移除。<br/>"

[ShadowOps_Rocketeer X2AbilityTemplate]
LocFriendlyName="火箭专家"
LocLongDescription="你的重武器增加一次可用次数。"
LocHelpText="你的重武器增加一次可用次数。"
LocFlyOverText="火箭专家"
LocPromotionPopupText="<Bullet/>重武器指只能由E.X.O.护甲或W.A.R.护甲搭载的武器，比如火箭发射器。<br/>"

[ShadowOps_Vanish X2AbilityTemplate]
LocFriendlyName="无影无踪"
LocLongDescription="如果你的回合开始时视野内没有敌人，那么就获得隐蔽状态。此效果需要2回合冷却。"
LocHelpText="如果你的回合开始时视野内没有敌人，那么就获得隐蔽状态。"
LocFlyOverText="无影无踪"
LocPromotionPopupText="<Bullet/>拥有无影无踪技能的单位是优秀的侦察兵。如果被敌人发现了，只要暂时撤退就可以重新进入隐蔽状态。<br/><Bullet/>使用无影无踪获得隐蔽状态没有次数限制。<br/><Bullet/>无影无踪需要2回合冷却。<br/>"

[ShadowOps_VanishTrigger X2AbilityTemplate]
LocFriendlyName="无影无踪"
LocLongDescription="如果你的回合开始时视野内没有敌人，那么就获得隐蔽状态。此效果需要2回合冷却。"
LocHelpText="如果你的回合开始时视野内没有敌人，那么就获得隐蔽状态。"
LocFlyOverText="无影无踪"

[ShadowOps_RestorationProtocol X2AbilityTemplate]
LocFriendlyName="复苏协议"
LocLongDescription="让一个单位每回合回复<Ability:Heal/>点生命，总量为<Ability:MaxHeal/>点。同时稳定并复活失血或丧失意识的单位，移除某些负面效果。"
LocHelpText="让一个单位每回合回复生命，同时稳定并复活失血或丧失意识的单位。"
LocFlyOverText="复苏协议"
LocPromotionPopupText="<Bullet/>复苏协议可以让失血或丧失意识的单位重新投入战斗。把它留给真正需要它的单位。<br/><Bullet/>复苏协议每回合回复2点生命，总量为8点。第一次回复在技能使用后立即生效。<br/><Bullet/>试验场的战场药物项目使每回合回复生命增加至3点。<br/><Bullet/>高级的小精灵使回复总量增加。<br/><Bullet/>复苏协议每次任务可使用一次。<br/>"

[ShadowOps_StasisField X2AbilityTemplate]
LocFriendlyName="静滞力场"
LocLongDescription="让龙骑士和附近所有单位进入静滞状态，持续一回合。静滞状态中的单位无法行动，对伤害免疫。<Ability:SelfCooldown/>回合冷却。"
LocHelpText="让龙骑士和附近所有单位进入静滞状态，持续一回合。静滞状态中的单位无法行动，对伤害免疫。"
LocFlyOverText="静滞力场"
LocPromotionPopupText="<Bullet/>静滞力场同时影响友方和敌方单位。<br/><Bullet/>静滞力场需要<Ability:SelfCooldown/>回合冷却。<br/>"

[ShadowOps_PuppetProtocol X2AbilityTemplate]
LocFriendlyName="傀儡协议"
LocLongDescription="永久控制一个敌方机械单位。每次任务只能控制一个单位。如果能力发动成功，那么个人的隐蔽状态不会解除。"
LocHelpText="永久控制一个敌方机械单位。每次任务只能控制一个单位。"
LocFlyOverText="傀儡协议"
LocPromotionPopupText="<Bullet/>如果能力发动失败，只会导致隐蔽状态解除。<br/><Bullet/>傀儡协议发动失败不会减少可用次数。<br/><Bullet/>傀儡协议需要<Ability:SelfCooldown/>回合冷却。<br/>"

[ShadowOps_TacticalSense X2AbilityTemplate]
LocFriendlyName="优雅姿态"
LocLongDescription="视野中每存在一个敌人，你的闪避就<Ability:+Dodge/>，最多<Ability:+MaxDodge/>。"
LocHelpText="视野中每存在一个敌人，你的闪避就<Ability:+Dodge/>，最多<Ability:+MaxDodge/>。"
LocFlyOverText="优雅姿态"
LocPromotionPopupText="<Bullet>闪避提升敌人攻击造成擦伤的几率，使伤害减半。<br/><Bullet/>不包括小队视野范围内的单位。<br/>"

[ShadowOps_Aegis X2AbilityTemplate]
LocFriendlyName="庇护"
LocLongDescription="护盾协议降低33%敌人造成的伤害。"
LocHelpText="护盾协议降低33%敌人造成的伤害。"
LocFlyOverText="庇护"
LocPromotionPopupText="<Bullet/>护盾存在时，此项伤害减免适用于伤害总量，而不仅仅是被护盾吸收的伤害。<br/>"

[ShadowOps_IronWill X2AbilityTemplate]
LocFriendlyName="钢铁意志"
LocLongDescription="意志力增加<Ability:Will>。"
LocHelpText="意志力增加<Ability:Will>。"
LocFlyOverText="钢铁意志"
LocPromotionPopupText="<Bullet/>意志力降低士兵恐慌的几率，增加对灵能攻击的抵抗力，增加受到致命伤害后进入失血状态的几率。<br/>"

[ShadowOps_SensorOverlays X2AbilityTemplate]
LocFriendlyName="探测覆盖"
LocLongDescription="所有小队成员针对你能看见的敌人暴击率<Ability:+Crit>。"
LocHelpText="所有小队成员针对你能看见的敌人暴击率<Ability:+Crit>。"
LocFlyOverText="探测覆盖"
LocPromotionPopupText="<Bullet/>不包括小队视野范围内的单位。<br/>"

[ShadowOps_Supercharge X2AbilityTemplate]
LocFriendlyName="高功率"
LocLongDescription="小精灵所有能力增加一次可用次数。"
LocHelpText="小精灵所有能力增加一次可用次数。"
LocFlyOverText="高功率"
LocPromotionPopupText="<Bullet/>小精灵能力包括护盾协议、复苏协议和隐匿协议。<br/>"

[ShadowOps_ReverseEngineering X2AbilityTemplate]
LocFriendlyName="逆向工程"
LocLongDescription="入侵敌方单位永久提升技术分。"
LocHelpText="入侵敌方单位永久提升技术分。"
LocFlyOverText="逆向工程"
LocPromotionPopupText="<Bullet/>入侵敌方单位的技能包括失控协议、傀儡协议、头颅接入和头颅开采。<br/><Bullet/>即便入侵失败也可以提升技术分。<br/>"

[ShadowOps_Scout X2AbilityTemplate]
LocFriendlyName="侦察"
LocLongDescription="每次任务获得一次战场扫描器可用次数。"
LocHelpText="每次任务获得一次战场扫描器可用次数。"
LocFlyOverText="侦察"
LocPromotionPopupText="<Bullet/>效果与携带的战场扫描器叠加。<br/>"

[ShadowOps_Lightfoot X2AbilityTemplate]
LocFriendlyName="快脚"
LocLongDescription="移动力<Ability:+Mobility/>。隐匿时敌人对你的侦察范围减少20%。"
LocHelpText="移动力<Ability:+Mobility/>。隐匿时敌人对你的侦察范围减少20%。"
LocFlyOverText="快脚"
LocPromotionPopupText="<Bullet/>快脚赋予的额外移动力可以让你快速暴露敌人侧翼或抵达目标地点，但是要小心别走在小队太前面。<br/><Bullet/>对隐蔽状态下的加成可与其他提升隐匿效果的加成叠加，比如电子反制措施。<br/>"

[ShadowOps_Charge X2AbilityTemplate]
LocFriendlyName="冲锋！"
LocLongDescription="冲刺后行动。"
LocHelpText="冲刺后行动。"
LocFlyOverText="冲锋！"
LocPromotionPopupText="<Bullet/>冲锋有一次可用次数。<br/>"

; === Class templates ===

[ShadowOps_Dragoon X2SoldierClassTemplate]
DisplayName="龙骑兵"
ClassSummary="龙骑士的战场角色多面化，既可以装备上重型武器和护甲奔赴前线，也可以在渗透任务中跑得飞快而不被敌人发现。他们擅长保护和支援小队中的其他成员。"
LeftAbilityTreeTitle="圣骑士"
RightAbilityTreeTitle="游魂"
RandomNickNames[0]="击碎者"
RandomNickNames[1]="电路"
RandomNickNames[2]="核心转储"
RandomNickNames[3]="赛博"
RandomNickNames[4]="电子人"
RandomNickNames[5]="狮鹫"
RandomNickNames[6]="大锤"
RandomNickNames[7]="寄生虫"
RandomNickNames[8]="九头蛇"
RandomNickNames[9]="熨斗"
RandomNickNames[10]="蝎狮"
RandomNickNames[11]="牛头怪"
RandomNickNames[12]="迷宫"
RandomNickNames[13]="再一次"
RandomNickNames[14]="凤凰"
RandomNickNames[15]="领袖"
RandomNickNames[16]="红屏"
RandomNickNames[17]="火箭"
RandomNickNames[18]="军刀"
RandomNickNames[19]="狮身人"
RandomNickNames[20]="钢铁"
RandomNickNames[21]="会计师"
RandomNickNames[22]="独角兽"
RandomNickNames_Male[0]="兽人"
RandomNickNames_Female[0]="塞壬"

[ShadowOps_Dragoon_LW X2SoldierClassTemplate]
DisplayName="龙骑兵"
ClassSummary="龙骑士的战场角色多面化，既可以装备上重型武器和护甲奔赴前线，也可以在渗透任务中跑得飞快而不被敌人发现。他们擅长保护和支援小队中的其他成员。"
LeftAbilityTreeTitle="圣骑士"
RightAbilityTreeTitle="游魂"
RandomNickNames[0]="击碎者"
RandomNickNames[1]="电路"
RandomNickNames[2]="核心转储"
RandomNickNames[3]="赛博"
RandomNickNames[4]="电子人"
RandomNickNames[5]="狮鹫"
RandomNickNames[6]="大锤"
RandomNickNames[7]="寄生虫"
RandomNickNames[8]="九头蛇"
RandomNickNames[9]="熨斗"
RandomNickNames[10]="蝎狮"
RandomNickNames[11]="牛头怪"
RandomNickNames[12]="迷宫"
RandomNickNames[13]="再一次"
RandomNickNames[14]="凤凰"
RandomNickNames[15]="领袖"
RandomNickNames[16]="红屏"
RandomNickNames[17]="火箭"
RandomNickNames[18]="军刀"
RandomNickNames[19]="狮身人"
RandomNickNames[20]="钢铁"
RandomNickNames[21]="会计师"
RandomNickNames[22]="独角兽"
RandomNickNames_Male[0]="兽人"
RandomNickNames_Female[0]="塞壬"

; === GTS ability templates ===

[TacticalSenseUnlock X2SoldierAbilityUnlockTemplate]
DisplayName="龙骑士：优雅姿态"
Summary="视野中每个敌人为你+10闪避，最多+50。"

[DigitalWarfareUnlock_LW X2SoldierStatUnlockTemplate]
DisplayName="龙骑士：电子战争"
Summary="再获得一个个人芯片槽位。"

[ChargeUnlock_LW X2SoldierAbilityUnlockTemplate]
DisplayName="冲锋！"
Summary="所有士兵每次任务可用一次奔袭战术。"

